ТОИР_демо/src/Catalogs/торо_ВидыКоэффициентовРемонтныхОсобенностей/торо_ВидыКоэффициентовРемонтныхОсобенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыКоэффициентовРемонтныхОсобенностей</name>
  <attributes>
    <name>Рассчитываемый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗависитОтНаработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчитатьВозрастОтДатыИзготовления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНаработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </attributes>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_ВидыКоэффициентовРемонтныхОсобенностей/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Рассчитываемый = Число(Объект.Рассчитываемый);
	ЗависитОтНаработки = Число(Объект.ЗависитОтНаработки);
	СчитатьВозрастОтДатыИзготовления = Число(Объект.СчитатьВозрастОтДатыИзготовления);
	
	ВидКоэффициентаПриИзменении(Элементы.ВидКоэффициента);
	
	Если Объект.Рассчитываемый Тогда
		
		ЗависитОтНаработкиПриИзменении(Элементы.ЗависитОтНаработки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ЗависитОтНаработки = Булево(ЗависитОтНаработки);
	Объект.Рассчитываемый = Булево(Рассчитываемый);
	Объект.СчитатьВозрастОтДатыИзготовления = Булево(СчитатьВозрастОтДатыИзготовления);
	
	Если Объект.ЗависитОтНаработки Тогда
		Если Не ЗначениеЗаполнено(Объект.ПараметрНаработки) Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено поле ""Параметр наработки""'!"), СтатусСообщения.Внимание);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидКоэффициентаПриИзменении(Элемент)
	Элементы.Настройки.Видимость = Булево(Рассчитываемый);
КонецПроцедуры

&НаКлиенте
Процедура ЗависитОтНаработкиПриИзменении(Элемент)
	Если Булево(ЗависитОтНаработки) Тогда
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроек.ПодчиненныеЭлементы.Группа7;
	Иначе
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроек.ПодчиненныеЭлементы.Группа6;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
